#6.	Напишите программу в которой ФИО вводятся из текстового файла и затем выводятся на экран.
f=open("text1(3).txt")
print(f.read())
f.close()