#3.	Напишите объявление указателя на функцию, возвращающую long и принимающую целое.
def Foo(x,y):
    if x==y:
        return float(x/y)
    else:
        return False
x=1
y=1
print(Foo(x,y))
