#1.	Напишите объявление статической переменной – члена.
#2.	Напишите определение статической переменной – члена.

class Wood:
    branch=1
print(Wood.branch)
#1
#Статические переменные в Python это временные, объявленные внутри определения класса переменнные, но не внутри метода, являются переменными класса.#